zephyrproject-rtos/hal_espressif/zephyr/esp32c6/src/bt/esp_bt_adapter.c
/* This variable tells if BLE is running */
static bool s_ble_active = false;
#define MAIN_XTAL_FREQ_HZ                 (40000000)
#define MAIN_XTAL_FREQ_HZ_WORKROUND       (500000)
static DRAM_ATTR modem_clock_lpclk_src_t s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_INVALID;
static DRAM_ATTR uint32_t s_bt_lpclk_freq = 100000;

#define BLE_RTC_DELAY_US_LIGHT_SLEEP        (3200)
#define BLE_RTC_DELAY_US_MODEM_SLEEP        (500)

static struct k_thread bt_task_handle;

K_THREAD_STACK_DEFINE(bt_stack, CONFIG_ESP32_BT_CONTROLLER_STACK_SIZE);

static const struct osi_coex_funcs_t s_osi_coex_funcs_ro = {
	._magic = OSI_COEX_MAGIC_VALUE,
	._version = OSI_COEX_VERSION,
	._coex_wifi_sleep_set = NULL,
	._coex_core_ble_conn_dyn_prio_get = NULL,
	._coex_schm_status_bit_set = coex_schm_status_bit_set_wrapper,
	._coex_schm_status_bit_clear = coex_schm_status_bit_clear_wrapper,
};

struct ext_funcs_t ext_funcs_ro = {
	.ext_version = EXT_FUNC_VERSION,
	._esp_intr_alloc = esp_intr_alloc_wrapper,
	._esp_intr_free = esp_intr_free_wrapper,
	._malloc = bt_osi_mem_malloc_internal,
	._free = bt_osi_mem_free,
	._task_create = task_create_wrapper,
	._task_delete = task_delete_wrapper,
	._osi_assert = osi_assert_wrapper,
	._os_random = osi_random_wrapper,
	._ecc_gen_key_pair = esp_ecc_gen_key_pair,
	._ecc_gen_dh_key = esp_ecc_gen_dh_key,
#if CONFIG_IDF_TARGET_ESP32C6
	._esp_reset_modem = esp_reset_modem,
#endif /* CONFIG_IDF_TARGET_ESP32C6 */
	.magic = EXT_FUNC_MAGIC_VALUE,
};

#if CONFIG_IDF_TARGET_ESP32C6
static void IRAM_ATTR esp_reset_modem(uint8_t mdl_opts, uint8_t start)
{
	if (mdl_opts == 0x05) {
		if (start) {
#if CONFIG_SW_COEXIST_ENABLE || CONFIG_EXTERNAL_COEX_ENABLE
			coex_hw_timer_set(0x04, 0x02, 15, 0, 5000);
			coex_hw_timer_enable(0x04);
#endif /* CONFIG_SW_COEXIST_ENABLE || CONFIG_EXTERNAL_COEX_ENABLE */
			MODEM_SYSCON.modem_rst_conf.val |= (BIT(16) | BIT(18));
			MODEM_SYSCON.modem_rst_conf.val &= ~(BIT(16) | BIT(18));
		} else {
#if CONFIG_SW_COEXIST_ENABLE || CONFIG_EXTERNAL_COEX_ENABLE
			coex_hw_timer_disable(0x04);
#endif /* CONFIG_SW_COEXIST_ENABLE || CONFIG_EXTERNAL_COEX_ENABLE */
		}
	}
}

#endif /* CONFIG_IDF_TARGET_ESP32C6 */

static void IRAM_ATTR osi_assert_wrapper(const uint32_t ln, const char *fn, uint32_t param1,
					 uint32_t param2)
{
	BT_ASSERT_PRINT("BLE assert: line %d in function %s, param: 0x%x, 0x%x", ln, fn, param1,
			param2);
	assert(0);
}

static uint32_t IRAM_ATTR osi_random_wrapper(void)
{
	return esp_random();
}

static void coex_schm_status_bit_set_wrapper(uint32_t type, uint32_t status)
{
#if CONFIG_SW_COEXIST_ENABLE
	coex_schm_status_bit_set(type, status);
#endif /* CONFIG_SW_COEXIST_ENABLE */
}

static void coex_schm_status_bit_clear_wrapper(uint32_t type, uint32_t status)
{
#if CONFIG_SW_COEXIST_ENABLE
	coex_schm_status_bit_clear(type, status);
#endif /* CONFIG_SW_COEXIST_ENABLE */
}

static int task_create_wrapper(void *task_func, const char *name, uint32_t stack_depth, void *param,
			       uint32_t prio, void *task_handle, uint32_t core_id)
{
	k_tid_t tid =
		k_thread_create(&bt_task_handle, bt_stack, stack_depth, (k_thread_entry_t)task_func,
				param, NULL, NULL, K_PRIO_COOP(prio), K_INHERIT_PERMS, K_NO_WAIT);

	k_thread_name_set(tid, name);

	*(int32_t *)task_handle = (int32_t)tid;

	return 1;
}

static void task_delete_wrapper(void *task_handle)
{
	if (task_handle != NULL) {
		k_thread_abort((k_tid_t)task_handle);
	}

	k_object_release(&bt_task_handle);
}

static int esp_ecc_gen_key_pair(uint8_t *pub, uint8_t *priv)
{
	int rc = -1;
#if CONFIG_ESP32_BT_LE_SM_LEGACY || CONFIG_ESP32_BT_LE_SM_SC
	rc = ble_sm_alg_gen_key_pair(pub, priv);
#endif /* CONFIG_ESP32_BT_LE_SM_LEGACY || CONFIG_ESP32_BT_LE_SM_SC */
	return rc;
}

static int esp_ecc_gen_dh_key(const uint8_t *peer_pub_key_x, const uint8_t *peer_pub_key_y,
			      const uint8_t *our_priv_key, uint8_t *out_dhkey)
{
	int rc = -1;
#if CONFIG_ESP32_BT_LE_SM_LEGACY || CONFIG_ESP32_BT_LE_SM_SC
	rc = ble_sm_alg_gen_dhkey(peer_pub_key_x, peer_pub_key_y, our_priv_key, out_dhkey);
#endif /* CONFIG_ESP32_BT_LE_SM_LEGACY || CONFIG_ESP32_BT_LE_SM_SC */
	return rc;
}

static int esp_intr_alloc_wrapper(int source, int flags, intr_handler_t handler, void *arg,
				  void **ret_handle_in)
{
	int rc = esp_intr_alloc(source, flags | ESP_INTR_FLAG_IRAM, (void *)handler, arg,
							(intr_handle_t *)ret_handle_in);
	return rc;
}

static int esp_intr_free_wrapper(void **ret_handle)
{
	int rc = 0;

	rc = esp_intr_free((intr_handle_t)*ret_handle);
	*ret_handle = NULL;

	return rc;
}

void esp_bt_rtc_slow_clk_select(uint8_t slow_clk_src)
{
	/* Select slow clock source for BT module */
	switch (slow_clk_src) {
	case MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL:
#if SOC_BLE_USE_WIFI_PWR_CLK_WORKAROUND
		uint32_t chip_version = efuse_hal_chip_revision();
		LOG_INF("Using main XTAL as clock source, chip ver: %d", chip_version);
		if (chip_version == 0) {
			modem_clock_select_lp_clock_source(PERIPH_BT_MODULE, slow_clk_src, (MAIN_XTAL_FREQ_HZ/s_bt_lpclk_freq - 1));
		} else{
			modem_clock_select_lp_clock_source(PERIPH_BT_MODULE, slow_clk_src, (MAIN_XTAL_FREQ_HZ_WORKROUND/s_bt_lpclk_freq - 1));
		}
#else
		LOG_INF("Using main XTAL as clock source");
		modem_clock_select_lp_clock_source(PERIPH_BT_MODULE, slow_clk_src, (MAIN_XTAL_FREQ_HZ/s_bt_lpclk_freq - 1));
#endif /* SOC_BLE_USE_WIFI_PWR_CLK_WORKAROUND */
		break;
	case MODEM_CLOCK_LPCLK_SRC_RC_SLOW:
		LOG_INF("Using 136 kHz RC as clock source, can only run legacy ADV or SCAN due to "
			"low clock accuracy!");
		modem_clock_select_lp_clock_source(PERIPH_BT_MODULE, slow_clk_src, (5 - 1));
		break;
	case MODEM_CLOCK_LPCLK_SRC_XTAL32K:
		LOG_INF("Using external 32.768 kHz XTAL as clock source");
		modem_clock_select_lp_clock_source(PERIPH_BT_MODULE, slow_clk_src, (1 - 1));
		break;
	case MODEM_CLOCK_LPCLK_SRC_RC32K:
		LOG_INF("Using 32 kHz RC as clock source, can only run legacy ADV or SCAN due to "
			"low clock accuracy!");
		modem_clock_select_lp_clock_source(PERIPH_BT_MODULE, slow_clk_src, (1 - 1));
		break;
	case MODEM_CLOCK_LPCLK_SRC_EXT32K:
		LOG_INF("Using 32 kHz oscillator as clock source, can only run legacy ADV or SCAN "
			"due to low clock accuracy!");
		modem_clock_select_lp_clock_source(PERIPH_BT_MODULE, slow_clk_src, (1 - 1));
		break;
	default:
	}
}

modem_clock_lpclk_src_t esp_bt_get_lpclk_src(void)
{
	return s_bt_lpclk_src;
}

void esp_bt_set_lpclk_src(modem_clock_lpclk_src_t clk_src)
{
	if (ble_controller_status != ESP_BT_CONTROLLER_STATUS_IDLE) {
		return;
	}

	if (clk_src >= MODEM_CLOCK_LPCLK_SRC_MAX) {
		return;
	}

	s_bt_lpclk_src = clk_src;
}

uint32_t esp_bt_get_lpclk_freq(void)
{
	return s_bt_lpclk_freq;
}

void esp_bt_set_lpclk_freq(uint32_t clk_freq)
{
	uint32_t xtal_freq;

