zephyrproject-rtos/hal_espressif/zephyr/esp32c6/src/bt/esp_bt_adapter.c
	if (ble_controller_status != ESP_BT_CONTROLLER_STATUS_IDLE) {
		return;
	}

	if (!clk_freq) {
		return;
	}

	xtal_freq = MAIN_XTAL_FREQ_HZ;
#if SOC_BLE_USE_WIFI_PWR_CLK_WORKAROUND
	uint32_t chip_version = efuse_hal_chip_revision();
	if (chip_version == 1) {
		xtal_freq = MAIN_XTAL_FREQ_HZ_WORKROUND;
	}
#endif /* SOC_BLE_USE_WIFI_PWR_CLK_WORKAROUND */

	if (xtal_freq % clk_freq) {
		return;
	}

	s_bt_lpclk_freq = clk_freq;
}

IRAM_ATTR void controller_sleep_cb(uint32_t enable_tick, void *arg)
{
	if (!s_ble_active) {
		return;
	}
	esp_phy_disable(PHY_MODEM_BT);

	s_ble_active = false;
}

IRAM_ATTR void controller_wakeup_cb(void *arg)
{
	if (s_ble_active) {
		return;
	}

	esp_phy_enable(PHY_MODEM_BT);
	if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_RC_SLOW) {
		uint32_t *clk_freq = (uint32_t *)arg;
		*clk_freq = esp_clk_tree_lp_slow_get_freq_hz(ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED) /	5;
	}
	s_ble_active = true;
}

esp_err_t controller_sleep_init(void)
{
	esp_err_t rc = 0;

#ifdef CONFIG_ESP32_BT_LE_SLEEP_ENABLE
	LOG_WRN("BLE modem sleep is enabled");
	r_ble_lll_rfmgmt_set_sleep_cb(controller_sleep_cb, controller_wakeup_cb, 0, 0,
				      BLE_RTC_DELAY_US_MODEM_SLEEP);
#endif /* CONFIG_ESP32_BT_LE_SLEEP_ENABLE */

	return rc;
}

void controller_sleep_deinit(void)
{

}

typedef enum {
	FILTER_DUPLICATE_PDUTYPE = BIT(0),
	FILTER_DUPLICATE_LENGTH = BIT(1),
	FILTER_DUPLICATE_ADDRESS = BIT(2),
	FILTER_DUPLICATE_ADVDATA = BIT(3),
	FILTER_DUPLICATE_DEFAULT = FILTER_DUPLICATE_PDUTYPE | FILTER_DUPLICATE_ADDRESS,
	FILTER_DUPLICATE_PDU_ALL = 0xF,
	FILTER_DUPLICATE_EXCEPTION_FOR_MESH = BIT(4),
	FILTER_DUPLICATE_AD_TYPE = BIT(5),
} disc_duplicate_mode_t;

extern void r_filter_duplicate_mode_enable(disc_duplicate_mode_t mode);
extern void r_filter_duplicate_mode_disable(disc_duplicate_mode_t mode);
extern void r_filter_duplicate_set_ring_list_max_num(uint32_t max_num);
extern void r_scan_duplicate_cache_refresh_set_time(uint32_t period_time);

int ble_vhci_disc_duplicate_mode_enable(int mode)
{
	/* TODO: use vendor hci to update */
	r_filter_duplicate_mode_enable(mode);
	return true;
}

int ble_vhci_disc_duplicate_mode_disable(int mode)
{
	/* TODO: use vendor hci to update */
	r_filter_duplicate_mode_disable(mode);
	return true;
}

int ble_vhci_disc_duplicate_set_max_cache_size(int max_cache_size)
{
	/* TODO: use vendor hci to update */
	r_filter_duplicate_set_ring_list_max_num(max_cache_size);
	return true;
}

int ble_vhci_disc_duplicate_set_period_refresh_time(int refresh_period_time)
{
	/* TODO: use vendor hci to update */
	r_scan_duplicate_cache_refresh_set_time(refresh_period_time);
	return true;
}

/**
 * @brief Config scan duplicate option mode from menuconfig (Adapt to the old configuration method.)
 */
void ble_controller_scan_duplicate_config(void)
{
	uint32_t duplicate_mode = FILTER_DUPLICATE_DEFAULT;
	uint32_t cache_size = 100;
#if CONFIG_ESP32_BT_LE_SCAN_DUPL == true
	cache_size = CONFIG_ESP32_BT_LE_LL_DUP_SCAN_LIST_COUNT;
	if (CONFIG_ESP32_BT_LE_SCAN_DUPL_TYPE == 0) {
		duplicate_mode = FILTER_DUPLICATE_ADDRESS | FILTER_DUPLICATE_PDUTYPE;
	} else if (CONFIG_ESP32_BT_LE_SCAN_DUPL_TYPE == 1) {
		duplicate_mode = FILTER_DUPLICATE_ADVDATA;
	} else if (CONFIG_ESP32_BT_LE_SCAN_DUPL_TYPE == 2) {
		duplicate_mode = FILTER_DUPLICATE_ADDRESS | FILTER_DUPLICATE_ADVDATA;
	}
	duplicate_mode |= FILTER_DUPLICATE_EXCEPTION_FOR_MESH;

	ble_vhci_disc_duplicate_set_period_refresh_time(CONFIG_ESP32_BT_LE_SCAN_DUPL_CACHE_REFRESH_PERIOD);
#endif

	ble_vhci_disc_duplicate_mode_disable(0xFFFFFFFF);
	ble_vhci_disc_duplicate_mode_enable(duplicate_mode);
	ble_vhci_disc_duplicate_set_max_cache_size(cache_size);
}

static void ble_rtc_clk_init(esp_bt_controller_config_t *cfg)
{
	if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_INVALID) {
#if CONFIG_ESP32_BT_LE_LP_CLK_SRC_MAIN_XTAL
		s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL;
#else
		soc_rtc_slow_clk_src_t slow_clk_src = rtc_clk_slow_src_get();

		switch (slow_clk_src) {
		case SOC_RTC_SLOW_CLK_SRC_RC_SLOW:
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_RC_SLOW;
			break;
		case SOC_RTC_SLOW_CLK_SRC_XTAL32K:
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_XTAL32K;
			break;
		case SOC_RTC_SLOW_CLK_SRC_RC32K:
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_RC32K;
			break;
		case SOC_RTC_SLOW_CLK_SRC_OSC_SLOW:
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_EXT32K;
			break;
		default:
			LOG_WRN("Unsupported slow clock source, fall back to "
				"main XTAL as Bluetooth sleep clock");
			s_bt_lpclk_src = MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL;
			break;
		}
#endif /* CONFIG_ESP32_BT_LE_LP_CLK_SRC_MAIN_XTAL */
	}

	if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_MAIN_XTAL) {
		cfg->rtc_freq = s_bt_lpclk_freq;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_XTAL32K) {
		cfg->rtc_freq = 32768;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_RC_SLOW) {
		cfg->rtc_freq =	esp_clk_tree_lp_slow_get_freq_hz(ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED) / 5;
		cfg->ble_ll_sca = 3000;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_RC32K) {
		cfg->rtc_freq = 32000;
	} else if (s_bt_lpclk_src == MODEM_CLOCK_LPCLK_SRC_EXT32K) {
		cfg->rtc_freq = 32000;
	}
	esp_bt_rtc_slow_clk_select(s_bt_lpclk_src);
}

esp_err_t esp_bt_controller_init(esp_bt_controller_config_t *cfg)
{
	uint8_t mac[6];
	esp_err_t ret = ESP_OK;
	ble_npl_count_info_t npl_info;
	uint8_t hci_transport_mode;

	memset(&npl_info, 0, sizeof(ble_npl_count_info_t));
	if (ble_controller_status != ESP_BT_CONTROLLER_STATUS_IDLE) {
		LOG_WRN("invalid controller state");
		return ESP_ERR_INVALID_STATE;
	}

	if (!cfg) {
		LOG_WRN("cfg is NULL");
		return ESP_ERR_INVALID_ARG;
	}

	ret = esp_register_ext_funcs(&ext_funcs_ro);
	if (ret != ESP_OK) {
		LOG_WRN("register extend functions failed");
		return ret;
	}

	/* Initialize the function pointers for OS porting */
	npl_zephyr_funcs_init();
	struct npl_funcs_t *p_npl_funcs = npl_zephyr_funcs_get();
	if (!p_npl_funcs) {
		LOG_WRN("npl functions get failed");
		return ESP_ERR_INVALID_ARG;
	}

	ret = esp_register_npl_funcs(p_npl_funcs);
	if (ret != ESP_OK) {
		LOG_WRN("npl functions register failed");
		goto free_mem;
	}

	r_ble_get_npl_element_info(cfg, &npl_info);
	npl_zephyr_set_controller_npl_info(&npl_info);
	if (npl_zephyr_mempool_init() != 0) {
		LOG_WRN("npl mempool init failed");
		ret = ESP_ERR_INVALID_ARG;
		goto free_mem;
	}

	/* Enable BT-related clocks */
	modem_clock_module_enable(PERIPH_BT_MODULE);
	modem_clock_module_mac_reset(PERIPH_BT_MODULE);
	/* Select slow clock source for BT module */
	ble_rtc_clk_init(cfg);
	esp_phy_modem_init();

	if (ble_osi_coex_funcs_register((struct osi_coex_funcs_t *)&s_osi_coex_funcs_ro) != 0) {
		LOG_WRN("osi coex funcs reg failed");
		ret = ESP_ERR_INVALID_ARG;
		goto modem_deint;
	}

#if CONFIG_SW_COEXIST_ENABLE
#ifndef CONFIG_WIFI_ESP32
	esp_coex_adapter_register(&g_coex_adapter_funcs);
	coex_pre_init();
#endif
	coex_init();
#endif /* CONFIG_SW_COEXIST_ENABLE */

	ret = esp_ble_register_bb_funcs();
	if (ret != ESP_OK) {
		LOG_WRN("esp_ble_register_bb_funcs failed %d", ret);
		goto modem_deint;
	}

	LOG_INF("ble controller commit:[%s]", ble_controller_get_compile_version());

	ret = r_ble_controller_init(cfg);
	if (ret != ESP_OK) {
		LOG_WRN("r_ble_controller_init failed %d", ret);
		goto modem_deint;
	}

