zephyrproject-rtos/hal_espressif/zephyr/esp32c6/src/bt/esp_bt_adapter.c
#if CONFIG_ESP32_BT_LE_LL_PEER_SCA_SET_ENABLE
	r_ble_ll_customize_peer_sca_set(CONFIG_ESP32_BT_LE_LL_PEER_SCA);
#endif

	ret = ble_stack_initEnv();
	if (ret != ESP_OK) {
		LOG_WRN("ble_stack_initEnv failed %d", ret);
		goto free_controller;
	}

	ble_controller_scan_duplicate_config();

	ret = os_msys_init();
	if (ret != ESP_OK) {
		LOG_WRN("msys_init failed %d", ret);
		goto free_controller;
	}

	ret = controller_sleep_init();
	if (ret != ESP_OK) {
		LOG_WRN("controller_sleep_init failed %d", ret);
		goto free_controller;
	}

	esp_read_mac((uint8_t *)mac, ESP_MAC_BT);
	LOG_INF("Bluetooth MAC: %02x:%02x:%02x:%02x:%02x:%02x", mac[0], mac[1], mac[2], mac[3],
		mac[4], mac[5]);
	swap_in_place(mac, 6);
	r_esp_ble_ll_set_public_addr(mac);

	ble_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

#if CONFIG_ESP32_BT_LE_HCI_INTERFACE_USE_RAM
	hci_transport_mode = HCI_TRANSPORT_VHCI;
#endif /* CONFIG_ESP32_BT_LE_HCI_INTERFACE_USE_RAM */
	ret = hci_transport_init(hci_transport_mode);
	if (ret) {
		LOG_WRN("hci transport init failed %d", ret);
		goto free_controller;
	}

	return ESP_OK;
free_controller:
	hci_transport_deinit();
	controller_sleep_deinit();
	os_msys_deinit();
	ble_stack_deinitEnv();
	r_ble_controller_deinit();
modem_deint:
	esp_ble_unregister_bb_funcs();
	esp_phy_modem_deinit();
	modem_clock_deselect_lp_clock_source(PERIPH_BT_MODULE);
	modem_clock_module_disable(PERIPH_BT_MODULE);
free_mem:
	npl_zephyr_mempool_deinit();
	esp_unregister_npl_funcs();
	npl_zephyr_funcs_deinit();
	esp_unregister_ext_funcs();
	return ret;
}

esp_err_t esp_bt_controller_deinit(void)
{
	if ((ble_controller_status < ESP_BT_CONTROLLER_STATUS_INITED) ||
	    (ble_controller_status >= ESP_BT_CONTROLLER_STATUS_ENABLED)) {
		LOG_WRN("invalid controller state");
		return ESP_FAIL;
	}

	hci_transport_deinit();
	controller_sleep_deinit();

	os_msys_deinit();

	esp_phy_modem_deinit();
	modem_clock_deselect_lp_clock_source(PERIPH_BT_MODULE);
	modem_clock_module_disable(PERIPH_BT_MODULE);

	ble_stack_deinitEnv();
	r_ble_controller_deinit();
	esp_ble_unregister_bb_funcs();

	esp_unregister_npl_funcs();

	esp_unregister_ext_funcs();

	/* De-initialize npl functions */
	npl_zephyr_funcs_deinit();

	npl_zephyr_mempool_deinit();

	ble_controller_status = ESP_BT_CONTROLLER_STATUS_IDLE;

	return ESP_OK;
}

esp_err_t esp_bt_controller_enable(esp_bt_mode_t mode)
{
	esp_err_t ret = ESP_OK;

	if (mode != ESP_BT_MODE_BLE) {
		LOG_WRN("invalid controller mode");
		return ESP_FAIL;
	}
	if (ble_controller_status != ESP_BT_CONTROLLER_STATUS_INITED) {
		LOG_WRN("invalid controller state");
		return ESP_FAIL;
	}
	if (!s_ble_active) {
		esp_phy_enable(PHY_MODEM_BT);
		s_ble_active = true;
	}
	esp_btbb_enable();
#if CONFIG_SW_COEXIST_ENABLE
	coex_enable();
#endif /* CONFIG_SW_COEXIST_ENABLE */

	if (ble_stack_enable() != 0) {
		ret = ESP_FAIL;
		goto error;
	}

	if (r_ble_controller_enable(mode) != 0) {
		ret = ESP_FAIL;
		goto error;
	}
	ble_controller_status = ESP_BT_CONTROLLER_STATUS_ENABLED;
	return ESP_OK;

error:
#if CONFIG_SW_COEXIST_ENABLE
	coex_disable();
#endif
	esp_btbb_disable();
	if (s_ble_active) {
		esp_phy_disable(PHY_MODEM_BT);
		s_ble_active = false;
	}
	return ret;
}

esp_err_t esp_bt_controller_disable(void)
{
	if (ble_controller_status < ESP_BT_CONTROLLER_STATUS_ENABLED) {
		LOG_WRN("invalid controller state");
		return ESP_FAIL;
	}
	if (r_ble_controller_disable() != 0) {
		return ESP_FAIL;
	}
#if CONFIG_SW_COEXIST_ENABLE
	coex_disable();
#endif
	esp_btbb_disable();
	if (s_ble_active) {
		esp_phy_disable(PHY_MODEM_BT);
		s_ble_active = false;
	}
	ble_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;
	return ESP_OK;
}

esp_err_t esp_bt_controller_mem_release(esp_bt_mode_t mode)
{
	LOG_WRN("%s not implemented, return OK", __func__);
	return ESP_OK;
}

esp_err_t esp_bt_mem_release(esp_bt_mode_t mode)
{
	LOG_WRN("%s not implemented, return OK", __func__);
	return ESP_OK;
}

esp_bt_controller_status_t esp_bt_controller_get_status(void)
{
	return ble_controller_status;
}

esp_err_t esp_ble_tx_power_set(esp_ble_power_type_t power_type, esp_power_level_t power_level)
{
	esp_err_t stat = ESP_FAIL;

	switch (power_type) {
	case ESP_BLE_PWR_TYPE_DEFAULT:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT, 0, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_PWR_TYPE_ADV:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_ADV, 0xFF, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_PWR_TYPE_SCAN:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_SCAN, 0, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_PWR_TYPE_CONN_HDL0:
	case ESP_BLE_PWR_TYPE_CONN_HDL1:
	case ESP_BLE_PWR_TYPE_CONN_HDL2:
	case ESP_BLE_PWR_TYPE_CONN_HDL3:
	case ESP_BLE_PWR_TYPE_CONN_HDL4:
	case ESP_BLE_PWR_TYPE_CONN_HDL5:
	case ESP_BLE_PWR_TYPE_CONN_HDL6:
	case ESP_BLE_PWR_TYPE_CONN_HDL7:
	case ESP_BLE_PWR_TYPE_CONN_HDL8:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_CONN, power_type, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	default:
		stat = ESP_ERR_NOT_SUPPORTED;
		break;
	}

	return stat;
}

esp_err_t esp_ble_tx_power_set_enhanced(esp_ble_enhanced_power_type_t power_type, uint16_t handle,
					esp_power_level_t power_level)
{
	esp_err_t stat = ESP_FAIL;
	switch (power_type) {
	case ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT, 0, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_ENHANCED_PWR_TYPE_SCAN:
	case ESP_BLE_ENHANCED_PWR_TYPE_INIT:
		if (r_ble_txpwr_set(ESP_BLE_ENHANCED_PWR_TYPE_SCAN, 0, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	case ESP_BLE_ENHANCED_PWR_TYPE_ADV:
	case ESP_BLE_ENHANCED_PWR_TYPE_CONN:
		if (r_ble_txpwr_set(power_type, handle, power_level) == 0) {
			stat = ESP_OK;
		}
		break;
	default:
		stat = ESP_ERR_NOT_SUPPORTED;
		break;
	}

	return stat;
}

esp_power_level_t esp_ble_tx_power_get(esp_ble_power_type_t power_type)
{
	int tx_level = 0;

	switch (power_type) {
	case ESP_BLE_PWR_TYPE_DEFAULT:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_DEFAULT, 0);
		break;
	case ESP_BLE_PWR_TYPE_ADV:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_ADV, 0);
		break;
	case ESP_BLE_PWR_TYPE_SCAN:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_SCAN, 0);
		break;
	case ESP_BLE_PWR_TYPE_CONN_HDL0:
	case ESP_BLE_PWR_TYPE_CONN_HDL1:
	case ESP_BLE_PWR_TYPE_CONN_HDL2:
	case ESP_BLE_PWR_TYPE_CONN_HDL3:
	case ESP_BLE_PWR_TYPE_CONN_HDL4:
	case ESP_BLE_PWR_TYPE_CONN_HDL5:
	case ESP_BLE_PWR_TYPE_CONN_HDL6:
	case ESP_BLE_PWR_TYPE_CONN_HDL7:
	case ESP_BLE_PWR_TYPE_CONN_HDL8:
		tx_level = r_ble_txpwr_get(ESP_BLE_ENHANCED_PWR_TYPE_CONN, power_type);
		break;
	default:
		return ESP_PWR_LVL_INVALID;
	}

	if (tx_level < 0) {
		return ESP_PWR_LVL_INVALID;
	}

